output/posts/git/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>git | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/git/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../pdftk/" title="pdftk: The PDF Toolkit" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="git">
<meta property="og:url" content="https://chimez.github.io/posts/git/">
<meta property="og:description" content='使用案例



新建仓库

   git init .





下载远程仓库

   git clone --depth=1 https://...


--depth=1 表示只下载一部分历史





gitignore：忽略文件


见 gitignore





添加本地更改

   git add --all 
   git commit -m "sth"





从远端获取更新
'>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-01-24T12:51:36+08:00">
<meta property="article:tag" content="linux git">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">git</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-01-24T12:51:36+08:00" itemprop="datePublished" title="2021-01-24 12:51">2021-01-24 12:51</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org6e88fe3" class="outline-2">
<h2 id="org6e88fe3">使用案例</h2>
<div class="outline-text-2" id="text-org6e88fe3">
</div>
<div id="outline-container-org6a40f45" class="outline-3">
<h3 id="org6a40f45">新建仓库</h3>
<div class="outline-text-3" id="text-org6a40f45">
<div class="highlight"><pre><span></span>   git init .
</pre></div>
</div>
</div>

<div id="outline-container-orgcb6961d" class="outline-3">
<h3 id="orgcb6961d">下载远程仓库</h3>
<div class="outline-text-3" id="text-orgcb6961d">
<div class="highlight"><pre><span></span>   git clone --depth=1 https://...
</pre></div>
<p>
<code>--depth=1</code> 表示只下载一部分历史
</p>
</div>
</div>

<div id="outline-container-org2a4e425" class="outline-3">
<h3 id="org2a4e425">gitignore：忽略文件</h3>
<div class="outline-text-3" id="text-org2a4e425">
<p>
见 <a href="https://github.com/github/gitignore">gitignore</a>
</p>
</div>
</div>

<div id="outline-container-org3abcd5a" class="outline-3">
<h3 id="org3abcd5a">添加本地更改</h3>
<div class="outline-text-3" id="text-org3abcd5a">
<div class="highlight"><pre><span></span>   git add --all 
   git commit -m "sth"
</pre></div>
</div>
</div>

<div id="outline-container-orgf95e506" class="outline-3">
<h3 id="orgf95e506">从远端获取更新</h3>
<div class="outline-text-3" id="text-orgf95e506">
<div class="highlight"><pre><span></span>   git pull
</pre></div>
</div>
</div>

<div id="outline-container-orgb9c27cf" class="outline-3">
<h3 id="orgb9c27cf">推送更新到远端</h3>
<div class="outline-text-3" id="text-orgb9c27cf">
<div class="highlight"><pre><span></span>   git push origin master
</pre></div>
</div>
</div>

<div id="outline-container-org503c960" class="outline-3">
<h3 id="org503c960">使用代理</h3>
<div class="outline-text-3" id="text-org503c960">
<div class="highlight"><pre><span></span>   git config --global http.proxy http://proxy.mycompany:80
</pre></div>
</div>
</div>

<div id="outline-container-org404ac7d" class="outline-3">
<h3 id="org404ac7d">记录里显示中文</h3>
<div class="outline-text-3" id="text-org404ac7d">
<div class="highlight"><pre><span></span>   git config --global core.quotepath false
</pre></div>
</div>
</div>
</div>

<div id="outline-container-org6602367" class="outline-2">
<h2 id="org6602367">git-lfs: 用 git 管理大文件</h2>
<div class="outline-text-2" id="text-org6602367">
</div>
<div id="outline-container-orgbf9e2a8" class="outline-3">
<h3 id="orgbf9e2a8">安装</h3>
<div class="outline-text-3" id="text-orgbf9e2a8">
<p>
从包管理器中安装 <code>git-lfs</code> ，windows版本已经包含了
</p>
</div>
</div>

<div id="outline-container-org5f733aa" class="outline-3">
<h3 id="org5f733aa">使用</h3>
<div class="outline-text-3" id="text-org5f733aa">
<ol class="org-ol">
<li>对账户启用 <code>git lfs install</code>
</li>
<li>对仓库设置要追踪的文件类型 <code>git lfs track "*.psd"</code>
</li>
<li>把配置文件加到追踪列表里 <code>git add .gitattributes</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgeb454ed" class="outline-3">
<h3 id="orgeb454ed">常用大文件</h3>
<div class="outline-text-3" id="text-orgeb454ed">
<p>
见 <a href="https://github.com/alexkaratarakis/gitattributes">gitattributes</a>
</p>
<div class="highlight"><pre><span></span>   git lfs track "*.png"
   git lfs track "*.jpg"
   git lfs track "*.jpeg"
   git lfs track "*.gif"

   git lfs track "*.mp4"
   git lfs track "*.mpeg"
   git lfs track "*.mkv"
</pre></div>

<p>
<code>.gitattributes</code> 文件内容为
</p>
<pre class="example">
*.pdf   filter=lfs diff=lfs merge=lfs -text
*.jpg   filter=lfs diff=lfs merge=lfs -text
*.jpeg  filter=lfs diff=lfs merge=lfs -text
*.png   filter=lfs diff=lfs merge=lfs -text
*.gif   filter=lfs diff=lfs merge=lfs -text
*.ico   filter=lfs diff=lfs merge=lfs -text
*.eps   filter=lfs diff=lfs merge=lfs -text
*.bmp   filter=lfs diff=lfs merge=lfs -text
*.psb   filter=lfs diff=lfs merge=lfs -text
*.tiff  filter=lfs diff=lfs merge=lfs -text
*.wbmp  filter=lfs diff=lfs merge=lfs -text
*.webp  filter=lfs diff=lfs merge=lfs -text
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc602fc0" class="outline-2">
<h2 id="orgc602fc0">git-remote-dropbox: 用 Dropbox 做私人仓库</h2>
<div class="outline-text-2" id="text-orgc602fc0">
<p>
<a href="https://github.com/anishathalye/git-remote-dropbox">git-remote-dropbox</a>
</p>
</div>
<div id="outline-container-orgec98b91" class="outline-3">
<h3 id="orgec98b91">安装</h3>
<div class="outline-text-3" id="text-orgec98b91">
<ol class="org-ol">
<li>安装 <code>pip install git-remote-dropbox</code>
</li>
<li>在网站上生成 OAuth 2 密钥 <a href="https://www.dropbox.com/developers/apps">app console</a>
</li>
<li>把密钥存在文件 <code>/.config/git/git-remote-dropbox.json or ~/.git-remote-dropbox.json
      ~{"default":"token"}</code>
</li>
<li>配置别名 <code>git config --global alias.dropbox '!git-dropbox-manage'</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-org8673798" class="outline-3">
<h3 id="org8673798">使用</h3>
<div class="outline-text-3" id="text-org8673798">
</div>
<div id="outline-container-orgef9c9bf" class="outline-4">
<h4 id="orgef9c9bf">clone 已有仓库</h4>
<div class="outline-text-4" id="text-orgef9c9bf">
<div class="highlight"><pre><span></span>    git clone "dropbox:///path/to/repo"
</pre></div>
</div>
</div>

<div id="outline-container-orgddc1a51" class="outline-4">
<h4 id="orgddc1a51">创建远程仓库</h4>
<div class="outline-text-4" id="text-orgddc1a51">
<div class="highlight"><pre><span></span>    git remote add origin "dropbox:///path/to/repo"
</pre></div>
</div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/linux-git/" rel="tag">linux git</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../pdftk/" rel="prev" title="pdftk: The PDF Toolkit">Previous post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
